[
    {
      "year": "2018",
      "id": "fa-seedling",
      "legend": "DWeb Camp - The Seeds Are Planted. Mai and Benedict meet, recognizing the contradiction of writing about decentralization while publishing on centralized platforms."
    },
    {
      "year": "2019",
      "id": "fa-lightbulb",
      "legend": "The Distributed Press Idea is Born. Benedict, Mai, and Udit begin developing the concept: if you want to build a tool, build a magazine as proof of concept."
    },
    {
      "year": "2019",
      "id": "fa-hand-holding-usd",
      "legend": "Grant for the Web. $50,000 Creative Commons Grant to build COMPOST Magazine as a proof-of-concept for decentralized publishing."
    },
    {
      "year": "2020",
      "id": "fa-book-open",
      "legend": "COMPOST Issue 01 launches. The first issue of COMPOST Magazine goes live, demonstrating the potential of decentralized publishing."
    },
    {
      "year": "2021",
      "id": "fa-rocket",
      "legend": "Distributed Press v0.1 Released. The first public release of Distributed Press, enabling websites to be published across HTTP, IPFS, and Hypercore protocols."
    },
    {
      "year": "2021",
      "id": "fa-newspaper",
      "legend": "COMPOST Issue 02 published. Second issue demonstrates the growing maturity of the platform."
    },
    {
      "year": "2022",
      "id": "fa-network-wired",
      "legend": "Filecoin Foundation Grant. FFDW provides crucial funding to expand Distributed Press infrastructure and capabilities."
    },
    {
      "year": "2022",
      "id": "fa-code",
      "legend": "API & Publisher Improvements. Major technical enhancements make Distributed Press more robust and easier to use."
    },
    {
      "year": "2023",
      "id": "fa-handshake",
      "legend": "Sutty Partnership Begins. Collaboration with Sutty CMS to integrate decentralized publishing into their platform."
    },
    {
      "year": "2023",
      "id": "fa-users",
      "legend": "Growing Adoption. Multiple publishers begin experimenting with Distributed Press for their content."
    },
    {
      "year": "2024",
      "id": "fa-globe",
      "legend": "DP Social Inbox Launch. Major feature release enabling ActivityPub integration for decentralized social features."
    },
    {
      "year": "2024",
      "id": "fa-puzzle-piece",
      "legend": "Product-Market Fit Challenges. Despite technical success, adoption remains limited due to industry inertia and resource constraints."
    },
    {
      "year": "2025",
      "id": "fa-road",
      "legend": "Building the Road as We Travel. FFDW grant concludes. Hypha commits to maintaining the architecture while reflecting on lessons learned."
    },
    {
      "year": "2025",
      "id": "fa-heart",
      "legend": "The Journey Continues. The infrastructure remains available, and the vision of decentralized publishing lives on."
    }
]
